20181126_testCube_dynamicCode/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    in
    {
        type            patch;
        nFaces          1089;
        startFace       104544;
    }
    shell
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4356;
        startFace       105633;
    }
    out
    {
        type            patch;
        nFaces          1089;
        startFace       109989;
    }
)

// ************************************************************************* //
