20181126_testCube_dynamicCode/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

dW              [0 1 0 0 0 0 0] 150e-06;		//water droplet diameter

// --- air 25°C

nu              [0 2 -1 0 0 0 0]	 1.555e-05;	// kinematic viscosity
mu              [1 -1 -1 0 0 0 0]	 1.837e-05;	// viscosity
rho             [1 -3 0 0 0 0 0 ]	 1.184;		// density

// --- water 25°C

nuw             [0 2 -1 0 0 0 0]	 8.9178e-07;	// kinematic viscosity
muW             [1 -1 -1 0 0 0 0]	 8.891e-04;	// viscosity
rhoW            [1 -3 0 0 0 0 0 ]	 997;		// density


// ************************************************************************* //
